// 企业发放的奖金根据利润提成。利润低于或等于100000元的，奖金可提10%;
// 利润高于100000元，低于200000元（100000<I≤200000）时，低于100000元的部分按10％提成，
// 高于100000元的部分，可提成 7.5%;
// 200000<I≤400000时，低于200000元部分仍按上述办法提成，（下同），高于200000元的部分按5％提成；
// 400000<I≤600000元时，高于400000元的部分按3％提成；600000<I≤1000000时，高于600000元的部分按1.5%提成；
// I>1000000时，超过1000000元的部分按1%提成。从键盘输入当月利润I,求应发奖金总数。
#include<bits/stdc++.h>
using namespace std;
void allowance(int m)
{
    float n=0.0;
    if(m<=100000)
        n = 0.1 * m;
    else if(m<=200000)
        n = 10000 + 0.075 * (m - 100000);
    else if(m<=400000)
        n = 17500 + 0.05 * (m - 200000);
    else if(m<=600000)
        n = 27500 + 0.03 * (m - 400000);
    else if(m<=1000000)
        n = 33500 + 0.015 * (m - 600000);
    else
        n = 39500 + 0.01 * (m - 1000000);
    cout << n;
}
int main()
{
    int m=0;
    cin >> m;
    allowance(m);
}